; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 874871 2 1 2 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	image0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star6 - direction
	Star5 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
)
(:goal (and
	(pointing satellite1 GroundStation7)
	(have_image Planet8 thermograph1)
	(have_image Planet9 image0)
	(have_image Star10 thermograph1)
	(have_image Planet11 image0)
	(have_image Star12 thermograph1)
	(have_image Star13 image0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite1 star5 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star5)
   goals met: 0 of 7
4. (turn_to satellite0 star13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star13)
   goals met: 0 of 7
5. (calibrate satellite1 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 0 of 7
6. (turn_to satellite0 planet9 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet9)
   goals met: 0 of 7
7. (turn_to satellite1 star13 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star13)
   goals met: 0 of 7
8. (turn_to satellite0 groundstation7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 7
9. (take_image satellite1 star13 instrument1 image0)
   added: (have_image star13 image0)
   goals met: 1 of 7
10. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 1 of 7
11. (turn_to satellite1 star12 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star12)
   goals met: 1 of 7
12. (turn_to satellite0 planet9 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet9)
   goals met: 1 of 7
13. (take_image satellite1 star12 instrument1 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 2 of 7
14. (take_image satellite0 planet9 instrument0 image0)
   added: (have_image planet9 image0)
   goals met: 3 of 7
15. (turn_to satellite1 star10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star10)
   goals met: 3 of 7
16. (turn_to satellite0 planet11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet11)
   goals met: 3 of 7
17. (take_image satellite1 star10 instrument1 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 4 of 7
18. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 5 of 7
19. (turn_to satellite1 planet8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet8)
   goals met: 5 of 7
20. (take_image satellite1 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 6 of 7
21. (turn_to satellite1 groundstation7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation7)
   goals met: 7 of 7
